<template>
    <Collapse v-model="value" class="panel">
        <Panel name="1">
            外表
            <template #content>吉娃娃犬以細小的體型、大眼睛、特別大的耳朵和直豎的尾巴為特徵。美國犬業俱樂部僅承認一種吉娃娃犬，但其實此犬種有許多型態、花色和長短毛之分。以長短毛來分，可分為短毛與長毛，短毛是我們目前較常見的，而長毛吉娃娃身上的毛光澤且柔軟，後肢肌肉較發達。生性懦弱且對冷很敏感，喜歡熱，愛曬太陽。長毛種耳朵、四肢、尾巴皆有裝飾毛，但長度並未拖地，在花色方面，墨西哥地區以前以黑色品種居多，不過現在毛色已呈多樣化，包括奶油色、紅色、褐色、黑色中摻有黃褐色、各種混色。另外牠們的重量介於1至5公斤之間，美國犬業俱樂部不認可超過3公斤的吉娃娃犬。</template>
        </Panel>
        <Panel name="2">
            性格
            <template #content>吉娃娃的性格極為神經質，絕大多數的吉娃娃喜歡到處吠叫，這也是吉娃娃之所以為人詬病的其中一點。由於牠們的體型很細小，身體十分瘦弱，所以極容易受到傷害。牠們細小的體型也為牠們帶來好處：因為牠們體型細小，使牠們能輕易適應現代的生活環境，包括市區和小公寓，適合老年人飼養。一般來說，小心飼養的話，吉娃娃犬都可以有長達17年及以上的壽命。</template>
        </Panel>
        <Panel name="3">
            保健
            <template #content>吉娃娃犬比其他犬類嬌貴，在出生時和牙齒方面需要專業獸醫的特別照顧，牠們也經常受一些神經類遺傳疾病所苦，如癲癇，還有膝關節脫臼的問題，部分進入老年容易有心臟與支氣管疾病，季節交替日夜溫差大時，易出現休克。廣為人知的還有牠們的頭顱骨留有囟門，簡單來說是頭蓋骨密合不全，在吉娃娃的頭頂上會留有一個小孔。健康的吉娃娃的眼珠圓亮飽滿、不混濁。</template>
        </Panel>
    </Collapse>
</template>
<script>
    export default {
        data () {
            return {
                value: '1'
            }
        }
    }
</script>
<style scoped lang="scss">
.panel{
    background-color: antiquewhite;
}
</style>